## 1) Write an SQL query to find all dates, temp, Id with higher temperatures compared to its previous dates (yesterday).
<pre>
Input:		
ID	RECORD_DATE	TEMEPERATURE
1	01-01-2015	10
2	02-01-2015	25
3	03-01-2015	20
4	04-01-2015	30
		
Output:		
ID	RECORD_DATE	TEMEPERATURE
2	02-01-2015	25
4	04-01-2015	30
</pre>

## 2) List the jobs unique to department 20?
## 3) List the employees belonging to the department of ‘MILLER’?
## 4) List all the employees who have the same job as ‘SCOTT’?

<pre>
## 1) Write an SQL query to find all dates, temp, Id with higher temperatures compared to its previous dates (yesterday).
Input:        
+------+-------------+-------------+
| id   | record_date | temperature |
+------+-------------+-------------+
|    1 | 2015-01-01  |          10 |
|    2 | 2015-01-02  |          25 |
|    3 | 2015-01-03  |          20 |
|    4 | 2015-01-04  |          30 |
+------+-------------+-------------+

Output:        
+------+-------------+-------------+
| id   | record_date | temperature |
+------+-------------+-------------+
|    2 | 2015-01-02  |          25 |
|    4 | 2015-01-04  |          30 |
+------+-------------+-------------+

mysql> Create Table table_1qa2(
    -> id int,
    -> record_date date,
    -> temperature int
    -> );
Query OK, 0 rows affected (0.02 sec)

mysql> insert into table_1qa2 (id,record_date,temperature) values (1,'2015-01-01',10),(2,'2015-01-02',25),(3,'2015-01-03',20),(4,'2015-01-04',30);
Query OK, 4 rows affected (0.00 sec)

mysql> select t2.id,t2.record_date,t2.temperature from table_1qa2 t1, table_1qa2 t2
    ->     where t2.id = 1+t1.id and
    ->     t2.temperature > t1.temperature;
+------+-------------+-------------+
| id   | record_date | temperature |
+------+-------------+-------------+
|    2 | 2015-01-02  |          25 |
|    4 | 2015-01-04  |          30 |
+------+-------------+-------------+
</pre>

<pre>

# 2) List the jobs unique to department 20?

mysql> select distinct job from emp where deptno = 20
    -> and job not in (select distinct job from emp where deptno != 20);
+---------+
| job     |
+---------+
| ANALYST |
+---------+
</pre>

<pre>

# 3 List the employees belonging to the department of ‘MILLER’?

Smysql> Select ename from emp where deptno in (select deptno from emp where ename = 'MILLER');
+--------+
| ename  |
+--------+
| CLARK  |
| KING   |
| MILLER |
+--------+

</pre>

<pre>

# 4) List all the employees who have the same job as ‘SCOTT’?

mysql> select ename from emp where job in (select job from emp where ename='SCOTT' );
+-------+
| ename |
+-------+
| SCOTT |
+-------+
1 row in set (0.00 sec)
</pre>

## 5) Write a query to get the below mentioned output from the data below?
<pre>
Input:
+------+
| col  |
+------+
| A    |
| B    |
| C    |
+------+

Output:
+------+------+
| COL1 | COL2 |
+------+------+
| A    | B    |
| A    | C    |
| B    | C    |
+------+------+
</pre>

## 6) List all the departments that have employees who exist in them?
## 7) List the employee details if and only if more than 2 employees are  present in department 10?
## 8) List the employee names whose salary is greater than the lowest salary  of an employee belonging to department 10?

<pre>
# 5 Write a query to get the below mentioned output from the data below?

Input:
+------+
| col  |
+------+
| A    |
| B    |
| C    |
+------+

Output:
+------+------+
| COL1 | COL2 |
+------+------+
| A    | B    |
| A    | C    |
| B    | C    |
+------+------+

mysql> create table table_q1a4 (
    -> col varchar(1)
    -> );
Query OK, 0 rows affected (0.01 sec)

mysql> insert into table_q1a4 (col) values ('A'),('B'),('C');
Query OK, 3 rows affected (0.00 sec)

insert into table_q1a4 (col) values ('A'),('B'),('C');

mysql> with t1 as  (select col, row_number() over() as row_num from table_q1a4)
    ->     select a.col as COL1,b.col as COL2 from t1 a, t1 b
    ->     where a.row_num < b.row_num order by a.col;
+------+------+
| COL1 | COL2 |
+------+------+
| A    | B    |
| A    | C    |
| B    | C    |
+------+------+

with t1 as  (select col, row_number() over() as row_num from table_q1a4)
select * from t1;

</pre>

<pre>
# 6) List all the departments that have employees who exist in them?

mysql> select distinct d.dname from emp e
    ->     left join dept d on e.deptno = d.deptno;
+------------+
| dname      |
+------------+
| ACCOUNTING |
| RESEARCH   |
| SALES      |
+------------+

</pre>

<pre>
# 7) List the employee details if and only if more than 2 employees are present in department 10

mysql> select * from emp where  (select count(*) from emp where deptno =10) > 2;
+-------+--------+-----------+------+------------+---------+---------+--------+
| empno | ename  | job       | mgr  | hiredate   | sal     | comm    | deptno |
+-------+--------+-----------+------+------------+---------+---------+--------+
|  7369 | SMITH  | CLERK     | 7902 | 1980-12-17 |  800.00 |    NULL |     20 |
|  7499 | ALLEN  | SALESMAN  | 7698 | 1981-02-20 | 1600.00 |  300.00 |     30 |
|  7521 | WARD   | SALESMAN  | 7698 | 1981-02-22 | 1250.00 |  500.00 |     30 |
|  7566 | JONES  | MANAGER   | 7839 | 1981-04-02 | 2975.00 |    NULL |     20 |
|  7654 | MARTIN | SALESMAN  | 7698 | 1981-09-28 | 1250.00 | 1400.00 |     30 |
|  7698 | BLAKE  | MANAGER   | 7839 | 1981-05-01 | 2850.00 |    NULL |     30 |
|  7782 | CLARK  | MANAGER   | 7839 | 1981-06-09 | 2450.00 |    NULL |     10 |
|  7788 | SCOTT  | ANALYST   | 7566 | 1987-06-13 | 3000.00 |    NULL |     20 |
|  7839 | KING   | PRESIDENT | NULL | 1981-11-17 | 5000.00 |    NULL |     10 |
|  7844 | TURNER | SALESMAN  | 7698 | 1981-09-08 | 1500.00 |    0.00 |     30 |
|  7876 | ADAMS  | CLERK     | 7788 | 1987-06-13 | 1100.00 |    NULL |     20 |
|  7900 | JAMES  | CLERK     | 7698 | 1981-12-03 |  950.00 |    NULL |     30 |
|  7934 | MILLER | CLERK     | 7782 | 1982-01-23 | 1300.00 |    NULL |     10 |
+-------+--------+-----------+------+------------+---------+---------+--------+
</pre>

<pre>
# 8) List the employee names whose salary is greater than the lowest salary of an employee belonging to department 10?

mysql> Select ename from emp where sal > (select min(sal) from emp where deptno = 10);
+--------+
| ename  |
+--------+
| ALLEN  |
| JONES  |
| BLAKE  |
| CLARK  |
| SCOTT  |
| KING   |
| TURNER |
+--------+
</pre>